text = 'Написать программу поиска самого длинного! слова в строке, разделенной точкой запятой.'
print('Написать программу поиска самого длинного! слова в строке, разделенной точкой запятой.')

a = text.split(' ')
index = a.index("слова")
print(index)


